[
  {
    "id": 1,
    "title": "Action Comics",
    "issue": "1",
    "year": "1938",
    "rating": 10,
    "read": false,
    "description": "The first appearance of Superman. It features the first appearance of several comic-book heroes—most notably the Jerry Siegel and Joe Shuster creation, Superman—and sold for 10 cents (equivalent to $2 in 2023). It is widely considered to be both the beginning of the superhero genre and the most valuable comic book in the world.",
    "imageUrl": "https://upload.wikimedia.org/wikipedia/en/5/5a/Action_Comics_1.jpg"
  },
  {
    "id": 2,
    "title": "Detective Comics",
    "issue": "27",
    "year": "1939",
    "rating": 9,
    "read": false,
    "description": "The debut of Batman with the story “The Case of the Chemical Syndicate” which is a bit of a whodunit to the story, a trap, a shady laboratory and of course, the beginnings of Batman’s mythology.",
    "imageUrl": "https://mlpnk72yciwc.i.optimole.com/cqhiHLc.IIZS~2ef73/w:600/h:850/q:75/https://bleedingcool.com/wp-content/uploads/2021/05/detective-comics-27.jpg"
  },
  {
    "id": 3,
    "title": "Amazing Fantasy",
    "issue": "15",
    "year": "1962",
    "rating": 10,
    "read": false,
    "description": "With issue #15 (Aug. 1962) Amazing Adult Fantasy was retitled Amazing Fantasy. This issue's lead feature introduced the superhero Spider-Man, written by Lee and drawn by Ditko, although Lee rejected Ditko's cover art and commissioned Jack Kirby to pencil a cover that Ditko inked.",
    "imageUrl": "https://m.media-amazon.com/images/I/51+yTH-4nHL._SY466_.jpg"
  },
  {
    "id": 1727382405004,
    "title": "Swamp Thing ",
    "issue": "20",
    "year": "1982",
    "rating": 7,
    "read": false,
    "description": "This issue marks the end of writer Martin Pasko's run and sets the stage for the groundbreaking stories that would follow under Alan Moore. Often referred to as a 'coda' or transitional issue, wrapping up loose ends from Pasko's storyline before Moore would take full creative control in the following issue (#21), which would begin his revolutionary 'Anatomy Lesson' arc. In this issue, Swamp Thing battles an evil doppelganger created by the villainous Anton Arcane.",
    "imageUrl": "https://static.wikia.nocookie.net/headhuntershorrorhouse/images/7/7e/Swamp_Thing_20.jpeg"
  },
  {
    "id": 4,
    "title": "The Doom Patrol Omnibus",
    "issue": "N/A",
    "year": "2014",
    "rating": 9,
    "read": true,
    "description": "The new Doom Patrol puts itself back together after nearly being destroyed, and things start to get a lot weirder for everybody. The Chief leads Robotman, the recently formed Rebis and new member Crazy Jane against the Scissormen, part of a dangerous philosophical location that has escaped into our world and is threatening to engulf reality itself. Written by Grant Morrison, this omnibus contains over 1200 pages of Doom Patrol's best stories from 1989-1993.",
    "imageUrl": "https://m.media-amazon.com/images/I/91T28za3MLL.jpg"
  },
  {
    "id": 5,
    "title": "Star Wars",
    "issue": "68",
    "year": "1983",
    "rating": 9,
    "read": false,
    "description": "This issue is set between The Empire Strikes Back and Return of the Jedi and follows the adventures of Princess Leia and Luke Skywalker as they continue their fight against the Empire. The cover prominently displays Boba Fett, who is hunting down Luke Skywalker. This issue also marks an important point in the Star Wars comics as it expands the lore of the Mandalorians, introducing Mandalore as a planet and setting the foundation for future Mandalorian stories.",
    "imageUrl": "https://i.etsystatic.com/22143117/r/il/320ca9/4383701791/il_fullxfull.4383701791_c8zs.jpg"
  },
  {
    "id": 6,
    "title": "Silver Surfer",
    "issue": "3",
    "year": "1968",
    "rating": 9,
    "read": true,
    "description": " A key issue in Marvel Comics history, notable for the first appearance of Mephisto, the demon-like villain who would go on to become one of the most iconic and powerful adversaries in the Marvel Universe. This comic was written by Stan Lee and illustrated by John Buscema.In this issue, Mephisto tries to corrupt the Silver Surfer, tempting him with power and riches in an attempt to make him an ally in his evil plans.",
    "imageUrl": "https://cdn.marvel.com/u/prod/marvel/i/mg/2/f0/51b6392403f2c/clean.jpg"
  },
  {
    "id": 7,
    "title": "2001: A Space Odyssey",
    "issue": "1 t0 10",
    "year": "1976-1977",
    "rating": 8,
    "read": false,
    "description": "A 10-issue comic book series by Jack Kirby and published by Marvel Comics between 1976-1977. The series is a loose adaptation of Stanley Kubrick's 1968 film and Arthur C. Clarke's accompanying novel, 2001: A Space Odyssey. Kirby introduced original characters and storylines that expanded upon the universe of 2001, exploring the philosophical and cosmic themes that are central to both the film and novel. ",
    "imageUrl": "https://m.media-amazon.com/images/I/71MtAwWpirL._AC_SL1050_.jpg"
  },
  {
    "id": 8,
    "title": "The Thing",
    "issue": "1 to 36",
    "year": "1983 to 1986",
    "rating": 9,
    "read": false,
    "description": "Written and illustrated by John Byrne and later by Mike Carlin, marked the start of a solo series for Ben Grimm, also known as The Thing from the Fantastic Four. John Byrne was a prominent Marvel writer and artist at the time, and his work on the Fantastic Four was highly regarded.In this comic, the focus shifts from the larger superhero team to Ben Grimm's personal struggles as he grapples with his transformation into the rock-like creature known as The Thing.",
    "imageUrl": "https://cdn.marvel.com/u/prod/marvel/i/mg/f/80/5c87da1bae84f/clean.jpg"
  },
  {
    "id": 9,
    "title": "Mysterious Suspense",
    "issue": "1",
    "year": "1968",
    "rating": 9,
    "read": false,
    "description": "A unique comic published by Charlton Comics and features the character The Question, created by Steve Ditko. This issue is notable because it is the only solo comic book appearance of The Question during the 1960s. The character, known for his distinctive blank face and philosophical approach to crime-fighting, was Ditko’s expression of his objectivist ideals, inspired by the works of Ayn Rand.",
    "imageUrl": "https://i.ebayimg.com/images/g/KpgAAOSwotxjxYyQ/s-l1600.webp"
  },
  {
    "id": 10,
    "title": "Swamp Thing",
    "issue": "37",
    "year": "1985",
    "rating": 8,
    "read": true,
    "description": "This issue features the first appearance of John Constantine, a character who would go on to star in his own series, Hellblazer. Written by Alan Moore and illustrated by Rick Veitch and John Totleben, this issue is part of Moore's celebrated run on Swamp Thing.In the story, Constantine, a mysterious and somewhat morally ambiguous occult detective, introduces himself to Swamp Thing (Alec Holland) and begins to guide him in understanding his true nature as an elemental being.",
    "imageUrl": "https://m.media-amazon.com/images/I/71SJEQIN4kL.jpg"
  },
  {
    "id": 11,
    "title": "The Ballad of Halo Jones",
    "issue": "1 to 27",
    "year": "1984-1986",
    "rating": 8,
    "read": false,
    "description": "A comic book series written by Alan Moore with art by Ian Gibson, first appearing in the British science fiction anthology 2000 AD in 1984. The story is set in a dystopian future and follows the life of Halo Jones, a young woman who seeks to escape her mundane existence in the Hoop, a slum-like floating city. The series is known for its rich character development and exploration of themes such as feminism, class, and the human desire for freedom.",
    "imageUrl": "https://m.media-amazon.com/images/I/81-Co2z+N1L._SL1500_.jpg"
  },
  {
    "id": 12,
    "title": "Moebius 1: Upon a Star",
    "issue": "N/A",
    "year": "1986",
    "rating": 9,
    "read": false,
    "description": "A graphic novel created by the legendary French artist Jean Giraud. In 'Upon a Star', part of his Moebius series, the story takes place in a futuristic, cosmic setting and reflects his profound fascination with space and metaphysical themes. The graphic novel blends science fiction with Moebius's characteristic exploration of deep, humanistic ideas, paired with his beautifully intricate and imaginative art style.",
    "imageUrl": "https://nexuswookie.wordpress.com/wp-content/uploads/2017/06/20170604_165955.jpg"
  },
  {
    "id": 13,
    "title": "The Sandman",
    "issue": "19",
    "year": "1990",
    "rating": 10,
    "read": true,
    "description": " titled 'A Midsummer Night's Dream', it is the third issue of the Dream Country story arc is a retelling of William Shakespeare's play but with a twist: in Gaiman’s narrative, Shakespeare and his actors perform the play for an audience of the actual Faerie court, including characters like Oberon, Titania, and Puck, who inspired Shakespeare's story in the first place.",
    "imageUrl": "https://m.media-amazon.com/images/I/71wJ8PMBBWL._SL1000_.jpg"
  }
]